Revit 2027 API
ParameterTypeId.ContinuousrailDefaultJoinTypeParam Property
 "Default Join"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousrailDefaultJoinTypeParam { get; }
Public Shared ReadOnly Property ContinuousrailDefaultJoinTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousrailDefaultJoinTypeParam {
	ForgeTypeId^ get ();
}
static member ContinuousrailDefaultJoinTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace